In [ ]:
! pip install pyspark

Collecting pyspark
  Downloading pyspark-3.5.1.tar.gz (317.0 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 317.0/317.0 MB 1.9 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.5.1-py2.py3-none-any.whl size=317488491 sha256=4c7dda1382bf8a70c4f55f477b02f838f8e702a31c6998a4fde6dc6f3533e519
  Stored in directory: /root/.cache/pip/wheels/80/1d/60/2c256ed38dddce2fdd93be545214a63e02fbd8d74fb0b7f3a6
Successfully built pyspark
Installing collected packages: pyspark
Successfully installed pyspark-3.5.1

In [ ]:
from pyspark.sql import SparkSession
from pyspark.sql.types import *
from pyspark.sql.functions import col,lit

In [ ]:
spark=SparkSession.builder.appName("part2").getOrCreate()

In [ ]:
testDf=[[1,"jan"],[2,"feb"],[1,"jan"],[3,"may"],[4,"april"],[5,"aug"],[6,"may"],[6,"may"],[3,"may"],[12,"dec"]]

In [ ]:
schema=StructType([StructField("ID",IntegerType()),StructField("Month",StringType())])

In [ ]:
df_new=spark.createDataFrame(testDf,schema=schema)

In [ ]:
df_new.show()

+---+-----+
| ID|Month|
+---+-----+
|  1|  jan|
|  2|  feb|
|  1|  jan|
|  3|  may|
|  4|april|
|  5|  aug|
|  6|  may|
|  6|  may|
|  3|  may|
| 12|  dec|
+---+-----+

In [ ]:
#To remove the duplicated rows with the dataframe we use distinct()

df_new.distinct().show()

+---+-----+
| ID|Month|
+---+-----+
|  4|april|
|  1|  jan|
|  2|  feb|
|  3|  may|
|  5|  aug|
| 12|  dec|
|  6|  may|
+---+-----+

In [ ]:
df_new.show()

+---+-----+
| ID|Month|
+---+-----+
|  1|  jan|
|  2|  feb|
|  1|  jan|
|  3|  may|
|  4|april|
|  5|  aug|
|  6|  may|
|  6|  may|
|  3|  may|
| 12|  dec|
+---+-----+

In [ ]:
# To remove the duplicates from the month column
df_new.dropDuplicates(["month"]).show()
df_new.dropDuplicates(["ID"]).show()
df_new.dropDuplicates(["ID","Month"]).show()

+---+-----+
| ID|Month|
+---+-----+
|  3|  may|
|  2|  feb|
|  4|april|
|  1|  jan|
|  5|  aug|
| 12|  dec|
+---+-----+

+---+-----+
| ID|Month|
+---+-----+
|  1|  jan|
|  2|  feb|
|  3|  may|
|  4|april|
|  5|  aug|
|  6|  may|
| 12|  dec|
+---+-----+

+---+-----+
| ID|Month|
+---+-----+
|  4|april|
|  1|  jan|
|  2|  feb|
|  3|  may|
|  5|  aug|
| 12|  dec|
|  6|  may|
+---+-----+

In [ ]:
df_new.rdd.getNumPartitions()

2

In [ ]:
#To save the spark sql dataframe into a csv

df_new.write.csv("df_new1.csv",header=True)

In [ ]:
dfn=df_new.coalesce(1)

In [ ]:
dfn.rdd.getNumPartitions()

1

*************PART-B***********************

In [ ]:
# In this Module we are going to discuss about using SQL in Spark SQL

In [ ]:
leader_data = [["Dodge","Mohammed Saif"],["Cadillac", "George Carlin"],["BMW", "Stuart Broad"], ["Ford", "Abdalla"], ["Hyundai", "Chris Gayle"],["Lexus", "George Bush"], ["Mercury", "Tatyaso Martin"]]

In [ ]:
schema = StructType([StructField("Manufacturer", StringType()), StructField("SalesPerson", StringType())])

In [ ]:
df_lead=spark.createDataFrame(leader_data,schema=schema)

In [ ]:
df_lead.show()

+------------+--------------+
|Manufacturer|   SalesPerson|
+------------+--------------+
|       Dodge| Mohammed Saif|
|    Cadillac| George Carlin|
|         BMW|  Stuart Broad|
|        Ford|       Abdalla|
|     Hyundai|   Chris Gayle|
|       Lexus|   George Bush|
|     Mercury|Tatyaso Martin|
+------------+--------------+

In [ ]:
# To convert the dataframe into sql table

df_lead.createOrReplaceTempView("salestable")

In [ ]:
spark.sql("select * from salestable").show(10,False)

+------------+--------------+
|Manufacturer|SalesPerson   |
+------------+--------------+
|Dodge       |Mohammed Saif |
|Cadillac    |George Carlin |
|BMW         |Stuart Broad  |
|Ford        |Abdalla       |
|Hyundai     |Chris Gayle   |
|Lexus       |George Bush   |
|Mercury     |Tatyaso Martin|
+------------+--------------+

In [ ]:
spark.sql("select * from salestable where Manufacturer == 'Cadillac'").show(5,False)

+------------+-------------+
|Manufacturer|SalesPerson  |
+------------+-------------+
|Cadillac    |George Carlin|
+------------+-------------+

In [ ]:
# let us check to which all brand chris gayle promotes to

spark.sql("select * from salestable where SalesPerson=='Chris Gayle'").show()

+------------+-----------+
|Manufacturer|SalesPerson|
+------------+-----------+
|     Hyundai|Chris Gayle|
+------------+-----------+

In [ ]:
#To display the names of employees who name starts with G

spark.sql("select * from salestable where SalesPerson like 'G%'").show()

+------------+-------------+
|Manufacturer|  SalesPerson|
+------------+-------------+
|    Cadillac|George Carlin|
|       Lexus|  George Bush|
+------------+-------------+

In [ ]:
# Print the names of salesperson whose name is ending with a

spark.sql("select * from salestable where Salesperson like '%n'").show()

+------------+--------------+
|Manufacturer|   SalesPerson|
+------------+--------------+
|    Cadillac| George Carlin|
|     Mercury|Tatyaso Martin|
+------------+--------------+

END OF SALESTABLE

---

In [ ]:
df_car=spark.read.csv("/content/Cars_Sale.csv",header=True)

In [ ]:
df_car.show(1)

+------------+-------+------------+-------------+-----------+-----------+-------------+--------+---------+--------+
|Manufacturer|  Model|Vehicle_type|Latest_Launch|Units_Price|Units_Sold |Cost_incurred| Revenue|     Cost|  Profit|
+------------+-------+------------+-------------+-----------+-----------+-------------+--------+---------+--------+
|       Acura|Integra|   Passenger|   02-02-2012|       21.5|     16.919|        16.36|363.7585|276.79484|86.96366|
+------------+-------+------------+-------------+-----------+-----------+-------------+--------+---------+--------+
only showing top 1 row

In [ ]:
#To rename the column in the data frame

df_car=df_car.withColumnRenamed("Profit","profit")

In [ ]:
df_car.show()

+------------+-----------+------------+-------------+-----------+-----------+-------------+-----------+-----------+-----------+
|Manufacturer|      Model|Vehicle_type|Latest_Launch|Units_Price|Units_Sold |Cost_incurred|    Revenue|       Cost|     profit|
+------------+-----------+------------+-------------+-----------+-----------+-------------+-----------+-----------+-----------+
|       Acura|    Integra|   Passenger|   02-02-2012|       21.5|     16.919|        16.36|   363.7585|  276.79484|   86.96366|
|       Acura|         TL|   Passenger|   06-03-2011|       28.4|     39.384|       19.875|  1118.5056|    782.757|   335.7486|
|       Acura|         CL|   Passenger|   01-04-2012|      35.44|     14.114|       18.225|  500.20016|  257.22765|  242.97251|
|       Acura|         RL|   Passenger|   03-10-2011|         42|      8.588|       29.725|    360.696|   255.2783|   105.4177|
|        Audi|         A4|   Passenger|   10-08-2011|      23.99|     20.397|       22.255|  489.32403| 453.935235|  35.388795|
|        Audi|         A6|   Passenger|   08-09-2011|      33.95|      18.78|       23.555|    637.581|   442.3629|   195.2181|
|        Audi|         A8|   Passenger|    2/27/2012|         62|       1.38|           39|      85.56|      53.82|      31.74|
|         BMW|       323i|   Passenger|    6/28/2011|      26.99|     19.747|           11|  532.97153|    217.217|  315.75453|
|         BMW|       328i|   Passenger|    1/29/2012|       33.4|      9.231|       28.675|   308.3154| 264.698925|  43.616475|
|         BMW|       528i|   Passenger|   04-04-2011|       38.9|     17.527|       36.125|   681.8003| 633.162875|  48.637425|
|       Buick|    Century|   Passenger|   11-02-2011|     21.975|     91.561|       12.475|2012.052975|1142.223475|   869.8295|
|       Buick|      Regal|   Passenger|   09-03-2011|       25.3|      39.35|        13.74|    995.555|    540.669|    454.886|
|       Buick|Park Avenue|   Passenger|    3/23/2012|     31.965|     27.851|        20.19| 890.257215|  562.31169| 327.945525|
|       Buick|    LeSabre|   Passenger|    7/23/2011|     27.885|     83.257|        13.36|2321.621445| 1112.31352|1209.307925|
|    Cadillac|    DeVille|   Passenger|    2/23/2012|     39.895|     63.729|       22.525|2542.468455|1435.495725| 1106.97273|
|    Cadillac|    Seville|   Passenger|    4/29/2011|     44.475|     15.943|         27.1| 709.064925|   432.0553| 277.009625|
|    Cadillac|   Eldorado|   Passenger|   11/27/2011|     39.665|      6.536|       25.725|  259.25044|   168.1386|   91.11184|
|    Cadillac|     Catera|   Passenger|    9/28/2011|      31.01|     11.185|       18.225|  346.84685| 203.846625| 143.000225|
|    Cadillac|   Escalade|         Car|    4/17/2012|     46.225|     14.785|           23| 683.436625|    340.055| 343.381625|
|   Chevrolet|   Cavalier|   Passenger|    8/17/2011|      13.26|    145.519|         9.25| 1929.58194| 1346.05075|  583.53119|
+------------+-----------+------------+-------------+-----------+-----------+-------------+-----------+-----------+-----------+
only showing top 20 rows

In [ ]:
#Converting the pyspark.sql dataframe to SQLTABLE with name CARSDATA


df_car.createOrReplaceTempView("carsdata")

In [ ]:
spark.sql("select * from carsdata").show(100)

+------------+--------------+------------+-------------+-----------+-----------+-------------+-----------+-----------+-----------+
|Manufacturer|         Model|Vehicle_type|Latest_Launch|Units_Price|Units_Sold |Cost_incurred|    Revenue|       Cost|     profit|
+------------+--------------+------------+-------------+-----------+-----------+-------------+-----------+-----------+-----------+
|       Acura|       Integra|   Passenger|   02-02-2012|       21.5|     16.919|        16.36|   363.7585|  276.79484|   86.96366|
|       Acura|            TL|   Passenger|   06-03-2011|       28.4|     39.384|       19.875|  1118.5056|    782.757|   335.7486|
|       Acura|            CL|   Passenger|   01-04-2012|      35.44|     14.114|       18.225|  500.20016|  257.22765|  242.97251|
|       Acura|            RL|   Passenger|   03-10-2011|         42|      8.588|       29.725|    360.696|   255.2783|   105.4177|
|        Audi|            A4|   Passenger|   10-08-2011|      23.99|     20.397|       22.255|  489.32403| 453.935235|  35.388795|
|        Audi|            A6|   Passenger|   08-09-2011|      33.95|      18.78|       23.555|    637.581|   442.3629|   195.2181|
|        Audi|            A8|   Passenger|    2/27/2012|         62|       1.38|           39|      85.56|      53.82|      31.74|
|         BMW|          323i|   Passenger|    6/28/2011|      26.99|     19.747|           11|  532.97153|    217.217|  315.75453|
|         BMW|          328i|   Passenger|    1/29/2012|       33.4|      9.231|       28.675|   308.3154| 264.698925|  43.616475|
|         BMW|          528i|   Passenger|   04-04-2011|       38.9|     17.527|       36.125|   681.8003| 633.162875|  48.637425|
|       Buick|       Century|   Passenger|   11-02-2011|     21.975|     91.561|       12.475|2012.052975|1142.223475|   869.8295|
|       Buick|         Regal|   Passenger|   09-03-2011|       25.3|      39.35|        13.74|    995.555|    540.669|    454.886|
|       Buick|   Park Avenue|   Passenger|    3/23/2012|     31.965|     27.851|        20.19| 890.257215|  562.31169| 327.945525|
|       Buick|       LeSabre|   Passenger|    7/23/2011|     27.885|     83.257|        13.36|2321.621445| 1112.31352|1209.307925|
|    Cadillac|       DeVille|   Passenger|    2/23/2012|     39.895|     63.729|       22.525|2542.468455|1435.495725| 1106.97273|
|    Cadillac|       Seville|   Passenger|    4/29/2011|     44.475|     15.943|         27.1| 709.064925|   432.0553| 277.009625|
|    Cadillac|      Eldorado|   Passenger|   11/27/2011|     39.665|      6.536|       25.725|  259.25044|   168.1386|   91.11184|
|    Cadillac|        Catera|   Passenger|    9/28/2011|      31.01|     11.185|       18.225|  346.84685| 203.846625| 143.000225|
|    Cadillac|      Escalade|         Car|    4/17/2012|     46.225|     14.785|           23| 683.436625|    340.055| 343.381625|
|   Chevrolet|      Cavalier|   Passenger|    8/17/2011|      13.26|    145.519|         9.25| 1929.58194| 1346.05075|  583.53119|
|   Chevrolet|        Malibu|   Passenger|    3/19/2012|     16.535|    135.126|       11.225| 2234.30841| 1516.78935|  717.51906|
|   Chevrolet|        Lumina|   Passenger|    5/24/2011|      18.89|     24.629|        10.31|  465.24181|  253.92499|  211.31682|
|   Chevrolet|   Monte Carlo|   Passenger|   12/22/2011|      19.39|     42.593|       11.525|  825.87827| 490.884325| 334.993945|
|   Chevrolet|        Camaro|   Passenger|   10/23/2011|      24.34|     26.402|       13.025|  642.62468|  343.88605|  298.73863|
|   Chevrolet|      Corvette|   Passenger|   05-12-2012|     45.705|     17.947|       36.225| 820.267635| 650.130075|  170.13756|
|   Chevrolet|         Prizm|   Passenger|   09-11-2011|      13.96|     32.299|        9.125|  450.89404| 294.728375| 156.165665|
|   Chevrolet|         Metro|   Passenger|    4/13/2012|      9.235|     21.855|         5.16| 201.830925|   112.7718|  89.059125|
|   Chevrolet|        Impala|   Passenger|    6/18/2011|      18.89|    107.995|         5.23| 2040.02555|  564.81385|  1475.2117|
|    Chrysler| Sebring Coupe|   Passenger|    1/16/2012|      19.84|      7.854|        12.36|  155.82336|   97.07544|   58.74792|
|    Chrysler| Sebring Conv.|   Passenger|   11/17/2011|     24.495|     32.775|        14.18| 802.823625|   464.7495| 338.074125|
|    Chrysler|      Concorde|   Passenger|   06-06-2012|     22.245|     31.148|       13.725|  692.88726|   427.5063|  265.38096|
|    Chrysler|        Cirrus|   Passenger|   10-06-2011|      16.48|     32.306|        12.64|  532.40288|  408.34784|  124.05504|
|    Chrysler|           LHS|   Passenger|   05-08-2012|      28.34|     13.462|       17.325|  381.51308|  233.22915|  148.28393|
|    Chrysler|Town & Country|         Car|    7/13/2011|      32.46|      53.48|        19.54|  1735.9608|  1044.9992|   690.9616|
|    Chrysler|          300M|   Passenger|   02-10-2012|     29.185|     30.696|        18.23|  895.86276|  559.58808|  336.27468|
|       Dodge|          Neon|   Passenger|   12-12-2011|      12.64|     76.034|         7.75|  961.06976|   589.2635|  371.80626|
|       Dodge|       Avenger|   Passenger|   07-01-2012|     19.045|      4.734|       12.545|   90.15903|   59.38803|     30.771|
|       Dodge|       Stratus|   Passenger|   10/31/2011|      20.23|     71.186|       10.185| 1440.09278|  725.02941|  715.06337|
|       Dodge|      Intrepid|   Passenger|   06-02-2012|     22.505|     88.028|       12.275| 1981.07014|  1080.5437|  900.52644|
|       Dodge|         Viper|   Passenger|   08-07-2011|     69.725|      0.916|        58.47|    63.8681|   53.55852|   10.30958|
|       Dodge|    Ram Pickup|         Car|   03-06-2012|      19.46|    227.061|        15.06| 4418.60706| 3419.53866|   999.0684|
|       Dodge|     Ram Wagon|         Car|   01-06-2012|     21.315|     16.767|        15.51| 357.388605|  260.05617|  97.332435|
|       Dodge|       Ram Van|         Car|    7/26/2012|     18.575|     31.038|       13.425|  576.53085|  416.68515|   159.8457|
|       Dodge|        Dakota|         Car|   11/25/2011|      16.98|    111.313|        11.26| 1890.09474| 1253.38438|  636.71036|
|       Dodge|       Durango|         Car|    6/27/2012|      26.31|    101.323|        18.12| 2665.80813| 1835.97276|  829.83537|
|       Dodge|       Caravan|         Car|   09-01-2011|     19.565|    181.749|       12.025|3555.919185|2185.531725| 1370.38746|
|        Ford|        Escort|   Passenger|    3/31/2012|      12.07|     70.227|        7.425|  847.63989| 521.435475| 326.204415|
|        Ford|       Mustang|   Passenger|    1/31/2012|      21.56|    113.369|        12.76| 2444.23564| 1446.58844|   997.6472|
|        Ford|       Contour|   Passenger|    8/20/2012|     17.035|     35.068|        8.835|  597.38338|  309.82578|   287.5576|
|        Ford|        Taurus|   Passenger|   12/20/2011|     17.885|    245.815|       10.055|4396.401275|2471.669825| 1924.73145|
|        Ford|         Focus|   Passenger|    7/22/2012|     12.315|     175.67|         6.14| 2163.37605|  1078.6138| 1084.76225|
|        Ford|Crown Victoria|   Passenger|    9/26/2011|     22.195|     63.403|        14.21|1407.229585|  900.95663| 506.272955|
|        Ford|      Explorer|         Car|    4/25/2012|      31.93|    276.747|        16.64| 8836.53171| 4605.07008| 4231.46163|
|        Ford|      Windstar|         Car|    2/25/2012|      21.41|    155.787|       13.175| 3335.39967|2052.493725|1282.905945|
|        Ford|    Expedition|         Car|    9/14/2012|     36.135|    125.338|       23.575| 4529.08863| 2954.84335| 1574.24528|
|        Ford|        Ranger|         Car|    1/14/2012|      12.05|     220.65|         7.85|  2658.8325|  1732.1025|     926.73|
|        Ford|      F-Series|         Car|    8/16/2012|     26.935|    540.561|       15.075|14560.01054|8148.957075| 6411.05346|
|       Honda|         Civic|   Passenger|   10/21/2011|     12.885|    199.685|         9.85|2572.941225| 1966.89725| 606.043975|
|       Honda|        Accord|   Passenger|    5/20/2012|      15.35|    230.902|        13.21|  3544.3457| 3050.21542|  494.13028|
|       Honda|          CR-V|         Car|    3/21/2012|      20.55|     73.203|        17.71| 1504.32165| 1296.42513|  207.89652|
|       Honda|      Passport|         Car|   10-09-2012|       26.6|     12.855|       17.525|    341.943| 225.283875| 116.659125|
|       Honda|       Odyssey|         Car|   02-08-2012|         26|     76.029|        19.49|   1976.754| 1481.80521|  494.94879|
|     Hyundai|        Accent|   Passenger|   09-10-2012|      9.699|     41.184|         5.86| 399.443616|  241.33824| 158.105376|
|     Hyundai|       Elantra|   Passenger|   11/15/2011|     11.799|     66.692|        7.825| 786.898908|   521.8649| 265.034008|
|     Hyundai|        Sonata|   Passenger|    6/14/2012|     14.999|      29.45|         8.91|  441.72055|   262.3995|  179.32105|
|    Infiniti|           I30|   Passenger|    4/15/2012|     29.465|     23.713|        19.69| 698.703545|  466.90897| 231.794575|
|      Jaguar|        S-Type|   Passenger|   11-03-2012|       42.8|     15.467|        23.04|   661.9876|  356.35968|  305.62792|
|        Jeep|      Wrangler|         Car|   03-04-2012|      14.46|     55.557|       13.475|  803.35422| 748.630575|  54.723645|
|        Jeep|      Cherokee|         Car|   10-05-2012|      21.62|     80.556|       13.775| 1741.62072|  1109.6589|  631.96182|
|        Jeep|Grand Cherokee|         Car|   12-10-2011|     26.895|     157.04|        18.81|  4223.5908|  2953.9224|  1269.6684|
|       Lexus|         ES300|   Passenger|   07-09-2012|     31.505|     24.072|       26.975|  758.38836|   649.3422|  109.04616|
|       Lexus|         GS300|   Passenger|   05-10-2012|     37.805|     12.698|       32.075|  480.04789|  407.28835|   72.75954|
|       Lexus|         GS400|   Passenger|   11/28/2012|     46.305|      3.334|        25.55|  154.38087|    85.1837|   69.19717|
|       Lexus|         LS400|   Passenger|    3/29/2012|     54.005|      6.375|       40.375| 344.281875| 257.390625|   86.89125|
|       Lexus|         LX470|         Car|   10/30/2012|     60.105|      9.126|        50.45|  548.51823|   460.4067|   88.11153|
|       Lexus|         RX300|         Car|   01-04-2012|     34.605|     51.238|        26.43| 1773.09099| 1354.22034|  418.87065|
|     Lincoln|   Continental|   Passenger|   08-03-2012|      39.08|     13.798|       20.525|  539.22584|  283.20395|  256.02189|
|     Lincoln|      Town car|   Passenger|   06-04-2012|      43.33|     48.911|       21.725| 2119.31363|1062.591475|1056.722155|
|     Lincoln|     Navigator|         Car|   12/23/2012|      42.66|     22.925|        27.89|   977.9805|  639.37825|  338.60225|
|  Mitsubishi|        Mirage|   Passenger|    4/23/2012|     13.987|     26.232|        8.325| 366.906984|   218.3814| 148.525584|
|  Mitsubishi|       Eclipse|   Passenger|   11/24/2012|     19.047|     42.541|       10.395| 810.278427| 442.213695| 368.064732|
|  Mitsubishi|        Galant|   Passenger|    1/29/2012|     17.357|     55.616|       10.595| 965.326912|  589.25152| 376.075392|
|  Mitsubishi|      Diamante|   Passenger|    8/28/2012|     24.997|      5.711|       16.575| 142.757867|  94.659825|  48.098042|
|  Mitsubishi|        3000GT|   Passenger|    6/29/2012|      25.45|       0.11|        20.94|     2.7995|     2.3034|     0.4961|
|  Mitsubishi|       Montero|         Car|    1/17/2012|     31.807|     11.337|       19.125| 360.595959| 216.820125| 143.775834|
|  Mitsubishi| Montero Sport|         Car|    5/18/2012|     22.527|     39.348|        13.88| 886.392396|  546.15024| 340.242156|
|     Mercury|      Mystique|   Passenger|   12/19/2012|      16.24|     14.351|          8.8|  233.06024|   126.2888|  106.77144|
|     Mercury|        Cougar|   Passenger|    2/23/2012|      16.54|     26.529|        13.89|  438.78966|  368.48781|   70.30185|
|     Mercury|         Sable|   Passenger|    9/22/2012|     19.035|     67.956|        11.03| 1293.54246|  749.55468|  543.98778|
|     Mercury| Grand Marquis|   Passenger|    7/24/2012|     22.605|     81.174|       14.875| 1834.93827| 1207.46325|  627.47502|
|     Mercury|   Mountaineer|         Car|    2/13/2008|      27.56|     27.609|        20.43|  760.90404|  564.05187|  196.85217|
|     Mercury|      Villager|         Car|   10/20/2009|      22.51|      20.38|       14.795|   458.7538|   301.5221|   157.2317|
|  Mercedes-B|       C-Class|   Passenger|    4/24/2011|      31.75|     18.392|        26.05|    583.946|   479.1116|   104.8344|
|  Mercedes-B|       E-Class|   Passenger|   07-12-2011|       49.9|     27.602|        41.45|  1377.3398|  1144.1029|   233.2369|
|  Mercedes-B|       S-Class|   Passenger|    6/13/2011|       69.7|     16.774|       50.375|  1169.1478|  844.99025|  324.15755|
|  Mercedes-B|      SL-Class|   Passenger|    3/17/2011|       82.6|      3.311|         58.6|   273.4886|   194.0246|     79.464|
|  Mercedes-B|           SLK|   Passenger|    1/16/2011|       38.9|      7.998|         28.9|   311.1222|   231.1422|      79.98|
|  Mercedes-B|        SLK230|   Passenger|   08-06-2011|         41|      1.526|           20|     62.566|      30.52|     32.046|
|  Mercedes-B|     CLK Coupe|   Passenger|   07-08-2011|       41.6|     11.592|        20.06|   482.2272|  232.53552|  249.69168|
|  Mercedes-B|         CL500|   Passenger|   04-11-2011|       85.5|      0.954|        64.83|     81.567|   61.84782|   19.71918|
+------------+--------------+------------+-------------+-----------+-----------+-------------+-----------+-----------+-----------+
only showing top 100 rows

In [ ]:
# To display the Acura as manufacturer

spark.sql("select * from carsdata where Manufacturer=='Acura'").show(100)

+------------+-------+------------+-------------+-----------+-----------+-------------+---------+---------+---------+
|Manufacturer|  Model|Vehicle_type|Latest_Launch|Units_Price|Units_Sold |Cost_incurred|  Revenue|     Cost|   profit|
+------------+-------+------------+-------------+-----------+-----------+-------------+---------+---------+---------+
|       Acura|Integra|   Passenger|   02-02-2012|       21.5|     16.919|        16.36| 363.7585|276.79484| 86.96366|
|       Acura|     TL|   Passenger|   06-03-2011|       28.4|     39.384|       19.875|1118.5056|  782.757| 335.7486|
|       Acura|     CL|   Passenger|   01-04-2012|      35.44|     14.114|       18.225|500.20016|257.22765|242.97251|
|       Acura|     RL|   Passenger|   03-10-2011|         42|      8.588|       29.725|  360.696| 255.2783| 105.4177|
+------------+-------+------------+-------------+-----------+-----------+-------------+---------+---------+---------+

In [ ]:
# To display the revenue genrated by each manufacturer

spark.sql("select Manufacturer,max(Revenue) from carsdata group by Manufacturer").show()

+------------+------------+
|Manufacturer|max(Revenue)|
+------------+------------+
|       Acura|   500.20016|
|        Audi|       85.56|
|         BMW|    681.8003|
|       Buick|     995.555|
|    Cadillac|  709.064925|
|   Chevrolet|   825.87827|
|    Chrysler|   895.86276|
|       Dodge|   961.06976|
|        Ford|  8836.53171|
|       Honda|   3544.3457|
|     Hyundai|  786.898908|
|    Infiniti|  698.703545|
|      Jaguar|    661.9876|
|        Jeep|   803.35422|
|       Lexus|   758.38836|
|     Lincoln|    977.9805|
|  Mercedes-B|      81.567|
|     Mercury|   760.90404|
|  Mitsubishi|  965.326912|
|      Nissan|  720.903892|
+------------+------------+
only showing top 20 rows

In [ ]:
spark.sql("select Manufacturer,max(Revenue) from carsdata group by Manufacturer order by Manufacturer").show()

+------------+------------+
|Manufacturer|max(Revenue)|
+------------+------------+
|       Acura|   500.20016|
|        Audi|       85.56|
|         BMW|    681.8003|
|       Buick|     995.555|
|    Cadillac|  709.064925|
|   Chevrolet|   825.87827|
|    Chrysler|   895.86276|
|       Dodge|   961.06976|
|        Ford|  8836.53171|
|       Honda|   3544.3457|
|     Hyundai|  786.898908|
|    Infiniti|  698.703545|
|      Jaguar|    661.9876|
|        Jeep|   803.35422|
|       Lexus|   758.38836|
|     Lincoln|    977.9805|
|  Mercedes-B|      81.567|
|     Mercury|   760.90404|
|  Mitsubishi|  965.326912|
|      Nissan|  720.903892|
+------------+------------+
only showing top 20 rows

In [ ]:
spark.sql("select Manufacturer,max(Revenue) from carsdata group by Manufacturer order by Manufacturer desc").show()

+------------+------------+
|Manufacturer|max(Revenue)|
+------------+------------+
|       Volvo|      86.498|
|  Volkswagen|       97.93|
|      Toyota|  969.354936|
|      Subaru|   663.69766|
|      Saturn|    861.4247|
|        Saab|    316.2015|
|     Porsche|     90.9056|
|     Pontiac|  853.873475|
|    Plymouth|     84.2592|
|  Oldsmobile|    931.0791|
|      Nissan|  720.903892|
|  Mitsubishi|  965.326912|
|     Mercury|   760.90404|
|  Mercedes-B|      81.567|
|     Lincoln|    977.9805|
|       Lexus|   758.38836|
|        Jeep|   803.35422|
|      Jaguar|    661.9876|
|    Infiniti|  698.703545|
|     Hyundai|  786.898908|
+------------+------------+
only showing top 20 rows

In [ ]:
# Performing Inner join of two tables carsdata and salestable

spark.sql("""select a.Manufacturer,a.Model,b.SalesPerson
from carsdata a
join salestable b
on trim(a.Manufacturer)= trim(b.Manufacturer)""").show(5,False)

+------------+---------+-------------+
|Manufacturer|Model    |SalesPerson  |
+------------+---------+-------------+
|Dodge       |Caravan  |Mohammed Saif|
|Dodge       |Durango  |Mohammed Saif|
|Dodge       |Dakota   |Mohammed Saif|
|Dodge       |Ram Van  |Mohammed Saif|
|Dodge       |Ram Wagon|Mohammed Saif|
+------------+---------+-------------+
only showing top 5 rows

In [ ]:
# Performing Inner join of two tables carsdata and salestable and where clause
spark.sql("""select a.Manufacturer,a.Model,b.SalesPerson
from carsdata a
join salestable b
on trim(a.Manufacturer)= trim(b.Manufacturer)
where trim(a.Manufacturer)='Cadillac'
""").show(5,False)

+------------+--------+-------------+
|Manufacturer|Model   |SalesPerson  |
+------------+--------+-------------+
|Cadillac    |Escalade|George Carlin|
|Cadillac    |Catera  |George Carlin|
|Cadillac    |Eldorado|George Carlin|
|Cadillac    |Seville |George Carlin|
|Cadillac    |DeVille |George Carlin|
+------------+--------+-------------+

In [ ]:
# saving the file
df_final = spark.sql("""select a.Manufacturer,a.Model,b.SalesPerson
from carsdata a
join salestable b
on trim(a.Manufacturer)= trim(b.Manufacturer)
where trim(a.Manufacturer)='Cadillac'
""")

In [101]:
df_final.coalesce(1).write.csv("vehicle1.csv",header=True)